#+title:    :lang graphql
#+subtitle: Give queries a REST
#+created:  March 31, 2022
#+since:    22.04.0 (#6226)

** Sending queries
When visiting a graphql buffer, you have access to the ability to send the
current query with =C-c C-c= which will prompt you for an optional variables file,
then execute the query and return a buffer of the results.

It's also possible to send queries using org-babel using a block such as the
ones below (executing correctly will require =:lang org=)

#+NAME: my-variables
#+begin_src json
{
    "continentCode": "AF"
}
#+end_src

#+BEGIN_SRC graphql :url https://countries.trevorblades.com/ :variables my-variables
query GetContinents($continentCode: String!) {
  continent(code: $continentCode) {
    name
    code
  }
}
#+END_SRC

#+RESULTS:
: {
:   "data": {
:     "continent": {
:       "name": "Africa",
:       "code": "AF"
:     }
:   }
: }

